Repository: danila-Skachedubov/freeipa-server-gpo
Catalog: locale/*/LC_MESSAGES/ipa-gpo-install.po
Languages: ru

source: Debug level: 0=errors, 1=warnings, 2=debug
ru: Уровень отладки: 0=ошибки, 1=предупреждения, 2=отладка

source: Only perform checks without making changes
ru: Только выполнить проверки без внесения изменений

source: Must be root to setup Group Policy features on server
ru: Необходимо быть пользователем root для настройки функций групповой политики на сервере

source: The log file for this installation can be found in {}
ru: Файл журнала для этой установки можно найти в {}

source: Initializing IPA API
ru: Инициализация API IPA

source: Connected to LDAP server
ru: Подключено к серверу LDAP

source: Outdated Kerberos credentials. Use kdestroy and kinit to update your ticket
ru: Устаревшие учетные данные Kerberos. Используйте kdestroy и kinit для обновления билета

source: Cannot connect to the LDAP database. Please check if IPA is running
ru: Невозможно подключиться к базе данных LDAP. Проверьте, работает ли IPA

source: Error setting up environment: {}
ru: Ошибка настройки окружения: {}

source: Checking Kerberos ticket
ru: Проверка билета Kerberos

source: Missing Kerberos ticket. Run 'kinit' to obtain a valid ticket.
ru: Отсутствует билет Kerberos. Выполните 'kinit' для получения действительного билета.

source: Checking admin privileges
ru: Проверка прав администратора

source: Administrative privileges required.
ru: Требуются права администратора.

source: Checking IPA services
ru: Проверка служб IPA

source: Essential IPA services are not running.
ru: Основные службы IPA не запущены.

source: Checking LDAP schema for required object classes
ru: Проверка схемы LDAP на наличие необходимых классов объектов

source: Checking if AD Trust is enabled
ru: Проверка, включено ли доверие AD

source: Checking SYSVOL directory and share
ru: Проверка каталога SYSVOL и общего ресурса

source: Running task: {}
ru: Выполнение задачи: {}

source: Task succeeded: {}
ru: Задача успешно выполнена: {}

source: Task failed: {}
ru: Задача не выполнена: {}

source: Task failed with error: {} - {}
ru: Задача не выполнена с ошибкой: {} - {}

source: Install AD Trust
ru: Установить доверие AD

source: Create SYSVOL directory
ru: Создать каталог SYSVOL

source: Create SYSVOL share
ru: Создать общий ресурс SYSVOL

source: Activate plugins
ru: Активировать плагины

source: Restart oddjob service
ru: Перезапуск службы oddjob

source: Plugins already activated
ru: Плагины уже активированы

source: Start GPUIService
ru: Запуск GPUIService

source: About to perform irreversible schema update
ru: Выполняется необратимое обновление схемы

source: Run ipa-server-upgrade
ru: Выполнить ipa-server-upgrade

source: Checking critical requirements
ru: Проверка критических требований

source: Performing configuration environment checks
ru: Выполнение проверок конфигурации окружения

source: Check-only mode: all checks completed
ru: Режим только проверки: все проверки завершены

source: ============================================================================= Setup complete The IPA LDAP schema has been extended with Group Policy related object classes. You can now proceed with Group Policy configuration. =============================================================================
ru: ============================================================================= Настройка завершена Схема IPA LDAP была расширена классами объектов, связанными с групповой политикой. Теперь вы можете приступить к настройке групповой политики. =============================================================================

source: Checking for valid Kerberos ticket
ru: Проверка наличия действительного билета Kerberos

source: Kerberos ticket exists for {}
ru: Билет Kerberos существует для {}

source: Valid Kerberos ticket not found
ru: Действительный билет Kerberos не найден

source: Error checking Kerberos ticket: {}
ru: Ошибка проверки билета Kerberos: {}

source: No valid Kerberos principal found
ru: Не найден действительный принципал Kerberos

source: User {} has admin privileges
ru: Пользователь {} имеет права администратора

source: User {} does not have admin privileges
ru: Пользователь {} не имеет прав администратора

source: Error checking admin privileges: {}
ru: Ошибка проверки прав администратора: {}

source: Cannot determine domain name for services check
ru: Невозможно определить имя домена для проверки служб

source: Running: {}
ru: Выполнение: {}

source: Service {} is not active - will be started during installation
ru: Служба {} не активна - будет запущена во время установки

source: Service {} is not active
ru: Служба {} не активна

source: Service {} is active
ru: Служба {} активна

source: All essential services are running
ru: Все основные службы работают

source: Error checking IPA services: {}
ru: Ошибка проверки служб IPA: {}

source: cn=schema not found, fallback to cn=subschema
ru: cn=schema не найден, использование резервного варианта cn=subschema

source: Object class '{}' does not exist in schema
ru: Класс объекта '{}' не существует в схеме

source: All required object classes exist in schema
ru: Все необходимые классы объектов существуют в схеме

source: Error checking schema object classes: {}
ru: Ошибка проверки классов объектов схемы: {}

source: AD Trust command not available
ru: Команда доверия AD недоступна

source: AD Trust is enabled
ru: Доверие AD включено

source: AD Trust is not enabled
ru: Доверие AD не включено

source: Error checking AD Trust status: {}
ru: Ошибка проверки статуса доверия AD: {}

source: SYSVOL directory exists with required structure
ru: Каталог SYSVOL существует с требуемой структурой

source: SYSVOL directory exists but missing subdirectories
ru: Каталог SYSVOL существует, но отсутствуют подкаталоги

source: SYSVOL directory does not exist: {}
ru: Каталог SYSVOL не существует: {}

source: Error checking SYSVOL directory: {}
ru: Ошибка проверки каталога SYSVOL: {}

source: Checking if SYSVOL share exists
ru: Проверка, существует ли общий ресурс SYSVOL

source: Error listing Samba shares: {}
ru: Ошибка при перечислении общих ресурсов Samba: {}

source: SYSVOL share exists
ru: Общий ресурс SYSVOL существует

source: SYSVOL share does not exist
ru: Общий ресурс SYSVOL не существует

source: Error checking SYSVOL share: {}
ru: Ошибка проверки общего ресурса SYSVOL: {}

source: Installing AD Trust support
ru: Установка поддержки доверия AD

source: ipa-adtrust-install not found
ru: ipa-adtrust-install не найден

source: Failed to install AD Trust: {}
ru: Не удалось установить доверие AD: {}

source: AD Trust installed successfully
ru: Доверие AD успешно установлено

source: Error installing AD Trust: {}
ru: Ошибка установки доверия AD: {}

source: Created directory: {}
ru: Создание директории: {}

source: Using standard permissions for SYSVOL directories
ru: Использование стандартных разрешений для каталогов SYSVOL

source: SYSVOL directory structure created successfully
ru: Структура каталога SYSVOL успешно создана

source: Error creating SYSVOL directory: {}
ru: Ошибка создания каталога SYSVOL: {}

source: Setting default ACLs on {}
ru: Установка ACL по умолчанию для {}

source: Failed to set ACLs on {}: {}
ru: Не удалось установить ACL для {}: {}

source: Successfully set default ACLs on {}
ru: Успешно установлены ACL по умолчанию для {}

source: Creating SYSVOL share for: {}
ru: Создание общего ресурса SYSVOL для: {}

source: Cannot create share: directory {} does not exist
ru: Невозможно создать общий ресурс: каталог {} не существует

source: Failed to create SYSVOL share: {}
ru: Не удалось создать общий ресурс SYSVOL: {}

source: Failed to set create mask parameter: {}
ru: Не удалось установить параметр create mask: {}

source: SYSVOL share created successfully
ru: Общий ресурс SYSVOL успешно создан

source: Error creating SYSVOL share: {}
ru: Ошибка создания общего ресурса SYSVOL: {}

source: Running ipa-server-upgrade to apply schema changes
ru: Запуск ipa-server-upgrade для обновления схемы

source: ipa-server-upgrade completed successfully
ru: Обновление схемы прошло успешно

source: Unknown error
ru: Неизвестная ошибка

source: ipa-server-upgrade failed: {}
ru: ipa-server-upgrade закончилось с ошибкой

source: Error running ipa-server-upgrade: {}
ru: Ошибка при обновления сервера

source: Initiating oddjob service restart
ru: Инициирование перезапуска службы oddjob

source: oddjob service is not running, starting it
ru: Служба oddjob не запущена, запускаем ее

source: Restarting oddjob service
ru: Выполняется перезапуск службы oddjob

source: oddjob service restarted successfully
ru: Служба oddjob успешно перезапущена

source: Failed to restart oddjob: {}
ru: Не удалось перезапустить службу oddjob: {}

source: Error restarting oddjob service: {}
ru: Ошибка перезапуска службы oddjob: {}

source: Checking GPUIService status
ru: Проверка состояния GPUIService

source: GPUIService is not running, starting it
ru: GPUIService не запущена, запускаем ее

source: GPUIService is already running
ru: GPUIService уже запущена

source: GPUIService started successfully
ru: GPUIService успешно запущена

source: Failed to start GPUIService: {}
ru: Не удалось запустить GPUIService: {}

source: Error starting GPUIService: {}
ru: Ошибка запуска GPUIService: {}

source: Plugin file not found: {}
ru: Файл плагина не найден: {}

source: Checking plugin files installation
ru: Проверка установки файлов плагинов

source: Plugin files missing. Please ensure the freeipa-server-gpo package is installed.
ru: Файлы плагинов отсутствуют. Убедитесь, что пакет freeipa-server-gpo установлен.

source: All plugin files are present
ru: Все файлы плагинов присутствуют
